STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp253dxx_ca35.h
/* Bit fields for RCC_C1BOOTRSTSCLRR register */
#define RCC_C1BOOTRSTSCLRR_PORRSTF_Pos               (0U)
#define RCC_C1BOOTRSTSCLRR_PORRSTF_Msk               (0x1UL << RCC_C1BOOTRSTSCLRR_PORRSTF_Pos)              /*!< 0x00000001 */
#define RCC_C1BOOTRSTSCLRR_PORRSTF                   RCC_C1BOOTRSTSCLRR_PORRSTF_Msk                        /*!< POR/PDR reset flag */
#define RCC_C1BOOTRSTSCLRR_BORRSTF_Pos               (1U)
#define RCC_C1BOOTRSTSCLRR_BORRSTF_Msk               (0x1UL << RCC_C1BOOTRSTSCLRR_BORRSTF_Pos)              /*!< 0x00000002 */
#define RCC_C1BOOTRSTSCLRR_BORRSTF                   RCC_C1BOOTRSTSCLRR_BORRSTF_Msk                        /*!< BOR reset flag */
#define RCC_C1BOOTRSTSCLRR_PADRSTF_Pos               (2U)
#define RCC_C1BOOTRSTSCLRR_PADRSTF_Msk               (0x1UL << RCC_C1BOOTRSTSCLRR_PADRSTF_Pos)              /*!< 0x00000004 */
#define RCC_C1BOOTRSTSCLRR_PADRSTF                   RCC_C1BOOTRSTSCLRR_PADRSTF_Msk                        /*!< NRST reset flag */
#define RCC_C1BOOTRSTSCLRR_HCSSRSTF_Pos              (3U)
#define RCC_C1BOOTRSTSCLRR_HCSSRSTF_Msk              (0x1UL << RCC_C1BOOTRSTSCLRR_HCSSRSTF_Pos)             /*!< 0x00000008 */
#define RCC_C1BOOTRSTSCLRR_HCSSRSTF                  RCC_C1BOOTRSTSCLRR_HCSSRSTF_Msk                       /*!< HSE CSS reset flag */
#define RCC_C1BOOTRSTSCLRR_VCORERSTF_Pos             (4U)
#define RCC_C1BOOTRSTSCLRR_VCORERSTF_Msk             (0x1UL << RCC_C1BOOTRSTSCLRR_VCORERSTF_Pos)            /*!< 0x00000010 */
#define RCC_C1BOOTRSTSCLRR_VCORERSTF                 RCC_C1BOOTRSTSCLRR_VCORERSTF_Msk                      /*!< V&lt;sub&gt;DDCORE&lt;/sub&gt; reset flag */
#define RCC_C1BOOTRSTSCLRR_VCPURSTF_Pos              (5U)
#define RCC_C1BOOTRSTSCLRR_VCPURSTF_Msk              (0x1UL << RCC_C1BOOTRSTSCLRR_VCPURSTF_Pos)             /*!< 0x00000020 */
#define RCC_C1BOOTRSTSCLRR_VCPURSTF                  RCC_C1BOOTRSTSCLRR_VCPURSTF_Msk                       /*!< V&lt;sub&gt;DDCPU&lt;/sub&gt; reset flag */
#define RCC_C1BOOTRSTSCLRR_SYSC1RSTF_Pos             (6U)
#define RCC_C1BOOTRSTSCLRR_SYSC1RSTF_Msk             (0x1UL << RCC_C1BOOTRSTSCLRR_SYSC1RSTF_Pos)            /*!< 0x00000040 */
#define RCC_C1BOOTRSTSCLRR_SYSC1RSTF                 RCC_C1BOOTRSTSCLRR_SYSC1RSTF_Msk                      /*!< CPU1 system reset flag */
#define RCC_C1BOOTRSTSCLRR_SYSC2RSTF_Pos             (7U)
#define RCC_C1BOOTRSTSCLRR_SYSC2RSTF_Msk             (0x1UL << RCC_C1BOOTRSTSCLRR_SYSC2RSTF_Pos)            /*!< 0x00000080 */
#define RCC_C1BOOTRSTSCLRR_SYSC2RSTF                 RCC_C1BOOTRSTSCLRR_SYSC2RSTF_Msk                      /*!< CPU2 system reset flag */
#define RCC_C1BOOTRSTSCLRR_IWDG1SYSRSTF_Pos          (8U)
#define RCC_C1BOOTRSTSCLRR_IWDG1SYSRSTF_Msk          (0x1UL << RCC_C1BOOTRSTSCLRR_IWDG1SYSRSTF_Pos)         /*!< 0x00000100 */
#define RCC_C1BOOTRSTSCLRR_IWDG1SYSRSTF              RCC_C1BOOTRSTSCLRR_IWDG1SYSRSTF_Msk                   /*!< IWDG1 system reset flag */
#define RCC_C1BOOTRSTSCLRR_IWDG2SYSRSTF_Pos          (9U)
#define RCC_C1BOOTRSTSCLRR_IWDG2SYSRSTF_Msk          (0x1UL << RCC_C1BOOTRSTSCLRR_IWDG2SYSRSTF_Pos)         /*!< 0x00000200 */
#define RCC_C1BOOTRSTSCLRR_IWDG2SYSRSTF              RCC_C1BOOTRSTSCLRR_IWDG2SYSRSTF_Msk                   /*!< IWDG2 system reset flag */
#define RCC_C1BOOTRSTSCLRR_IWDG3SYSRSTF_Pos          (10U)
#define RCC_C1BOOTRSTSCLRR_IWDG3SYSRSTF_Msk          (0x1UL << RCC_C1BOOTRSTSCLRR_IWDG3SYSRSTF_Pos)         /*!< 0x00000400 */
#define RCC_C1BOOTRSTSCLRR_IWDG3SYSRSTF              RCC_C1BOOTRSTSCLRR_IWDG3SYSRSTF_Msk                   /*!< IWDG3 system reset flag */
#define RCC_C1BOOTRSTSCLRR_IWDG4SYSRSTF_Pos          (11U)
#define RCC_C1BOOTRSTSCLRR_IWDG4SYSRSTF_Msk          (0x1UL << RCC_C1BOOTRSTSCLRR_IWDG4SYSRSTF_Pos)         /*!< 0x00000800 */
#define RCC_C1BOOTRSTSCLRR_IWDG4SYSRSTF              RCC_C1BOOTRSTSCLRR_IWDG4SYSRSTF_Msk                   /*!< IWDG4 system reset flag */
#define RCC_C1BOOTRSTSCLRR_IWDG5SYSRSTF_Pos          (12U)
#define RCC_C1BOOTRSTSCLRR_IWDG5SYSRSTF_Msk          (0x1UL << RCC_C1BOOTRSTSCLRR_IWDG5SYSRSTF_Pos)         /*!< 0x00001000 */
#define RCC_C1BOOTRSTSCLRR_IWDG5SYSRSTF              RCC_C1BOOTRSTSCLRR_IWDG5SYSRSTF_Msk                   /*!< IWDG5 system reset flag */
#define RCC_C1BOOTRSTSCLRR_C1RSTF_Pos                (13U)
#define RCC_C1BOOTRSTSCLRR_C1RSTF_Msk                (0x1UL << RCC_C1BOOTRSTSCLRR_C1RSTF_Pos)               /*!< 0x00002000 */
#define RCC_C1BOOTRSTSCLRR_C1RSTF                    RCC_C1BOOTRSTSCLRR_C1RSTF_Msk                         /*!< CPU1 reset flag */
#define RCC_C1BOOTRSTSCLRR_C1P1RSTF_Pos              (16U)
#define RCC_C1BOOTRSTSCLRR_C1P1RSTF_Msk              (0x1UL << RCC_C1BOOTRSTSCLRR_C1P1RSTF_Pos)             /*!< 0x00010000 */
#define RCC_C1BOOTRSTSCLRR_C1P1RSTF                  RCC_C1BOOTRSTSCLRR_C1P1RSTF_Msk                       /*!< CPU1 processor core 1 reset flag */
#define RCC_C1BOOTRSTSCLRR_RETCRCERRRSTF_Pos         (17U)
#define RCC_C1BOOTRSTSCLRR_RETCRCERRRSTF_Msk         (0x1UL << RCC_C1BOOTRSTSCLRR_RETCRCERRRSTF_Pos)        /*!< 0x00020000 */
#define RCC_C1BOOTRSTSCLRR_RETCRCERRRSTF             RCC_C1BOOTRSTSCLRR_RETCRCERRRSTF_Msk                  /*!< RETRAM CRC error reset flag */
#define RCC_C1BOOTRSTSCLRR_RETECCFAILCRCRSTF_Pos     (18U)
#define RCC_C1BOOTRSTSCLRR_RETECCFAILCRCRSTF_Msk     (0x1UL << RCC_C1BOOTRSTSCLRR_RETECCFAILCRCRSTF_Pos)    /*!< 0x00040000 */
#define RCC_C1BOOTRSTSCLRR_RETECCFAILCRCRSTF         RCC_C1BOOTRSTSCLRR_RETECCFAILCRCRSTF_Msk              /*!< RETRAM ECC failure reset flag during the CRC computation phase */
#define RCC_C1BOOTRSTSCLRR_RETECCFAILRESTRSTF_Pos    (19U)
#define RCC_C1BOOTRSTSCLRR_RETECCFAILRESTRSTF_Msk    (0x1UL << RCC_C1BOOTRSTSCLRR_RETECCFAILRESTRSTF_Pos)   /*!< 0x00080000 */
#define RCC_C1BOOTRSTSCLRR_RETECCFAILRESTRSTF        RCC_C1BOOTRSTSCLRR_RETECCFAILRESTRSTF_Msk             /*!< RETRAM ECC failure reset flag during system restoration phase */
#define RCC_C1BOOTRSTSCLRR_STBYC1RSTF_Pos            (20U)
#define RCC_C1BOOTRSTSCLRR_STBYC1RSTF_Msk            (0x1UL << RCC_C1BOOTRSTSCLRR_STBYC1RSTF_Pos)           /*!< 0x00100000 */
#define RCC_C1BOOTRSTSCLRR_STBYC1RSTF                RCC_C1BOOTRSTSCLRR_STBYC1RSTF_Msk                     /*!< CPU1 system Standby reset flag */
#define RCC_C1BOOTRSTSCLRR_D1STBYRSTF_Pos            (22U)
#define RCC_C1BOOTRSTSCLRR_D1STBYRSTF_Msk            (0x1UL << RCC_C1BOOTRSTSCLRR_D1STBYRSTF_Pos)           /*!< 0x00400000 */
#define RCC_C1BOOTRSTSCLRR_D1STBYRSTF                RCC_C1BOOTRSTSCLRR_D1STBYRSTF_Msk                     /*!< D1 DStandby reset flag */
#define RCC_C1BOOTRSTSCLRR_D2STBYRSTF_Pos            (23U)
#define RCC_C1BOOTRSTSCLRR_D2STBYRSTF_Msk            (0x1UL << RCC_C1BOOTRSTSCLRR_D2STBYRSTF_Pos)           /*!< 0x00800000 */
#define RCC_C1BOOTRSTSCLRR_D2STBYRSTF                RCC_C1BOOTRSTSCLRR_D2STBYRSTF_Msk                     /*!< D2 DStandby reset flag */

