STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp253dxx_ca35.h
/*******************  Bits definition for RTC_CFGR register  ******************/
#define RTC_CFGR_OUT2_RMP_Pos        (0U)
#define RTC_CFGR_OUT2_RMP_Msk        (0x1UL << RTC_CFGR_OUT2_RMP_Pos)                    /*!< 0x00000001 */
#define RTC_CFGR_OUT2_RMP            RTC_CFGR_OUT2_RMP_Msk

/********************  Bits definition for RTC_ALRABINR register  ******************/
#define RTC_ALRABINR_SS_Pos          (0U)
#define RTC_ALRABINR_SS_Msk          (0xFFFFFFFFUL << RTC_ALRABINR_SS_Pos)              /*!< 0xFFFFFFFF */
#define RTC_ALRABINR_SS              RTC_ALRABINR_SS_Msk

/********************  Bits definition for RTC_ALRBBINR register  ******************/
#define RTC_ALRBBINR_SS_Pos          (0U)
#define RTC_ALRBBINR_SS_Msk          (0xFFFFFFFFUL << RTC_ALRBBINR_SS_Pos)              /*!< 0xFFFFFFFF */
#define RTC_ALRBBINR_SS              RTC_ALRBBINR_SS_Msk

/********************  Bits definition for RTC_RCIDCFGR register  ******************/
#define RTC_RCIDCFGR_CFEN_Pos          (0U)
#define RTC_RCIDCFGR_CFEN_Msk          (0x1UL << RTC_RCIDCFGR_CFEN_Pos)                 /*!< 0xFFFFFFFF */
#define RTC_RCIDCFGR_CFEN              RTC_RCIDCFGR_CFEN_Msk
#define RTC_RCIDCFGR_CID_Pos           (4U)
#define RTC_RCIDCFGR_CID_Msk           (0xFUL << RTC_RCIDCFGR_CID_Pos)                  /*!< 0x000000F0 */
#define RTC_RCIDCFGR_CID               RTC_RCIDCFGR_CID_Msk

/********************  Bits definition for RTC_HWCFGR register  ******************/
#define RTC_HWCFGR_ALARMB_Pos          (0U)
#define RTC_HWCFGR_ALARMB_Msk          (0xFUL << RTC_HWCFGR_ALARMB_Pos)                 /*!< 0x0000000F */
#define RTC_HWCFGR_ALARMB              RTC_HWCFGR_ALARMB_Msk
#define RTC_HWCFGR_WAKEUP_Pos          (4U)
#define RTC_HWCFGR_WAKEUP_Msk          (0xFUL << RTC_HWCFGR_WAKEUP_Pos)                 /*!< 0x000000F0 */
#define RTC_HWCFGR_WAKEUP              RTC_HWCFGR_WAKEUP_Msk
#define RTC_HWCFGR_SMOOTH_CALIB_Pos    (8U)
#define RTC_HWCFGR_SMOOTH_CALIB_Msk    (0xFUL << RTC_HWCFGR_SMOOTH_CALIB_Pos)           /*!< 0x00000F00 */
#define RTC_HWCFGR_SMOOTH_CALIB        RTC_HWCFGR_SMOOTH_CALIB_Msk
#define RTC_HWCFGR_TIMESTAMP_Pos       (12U)
#define RTC_HWCFGR_TIMESTAMP_Msk       (0xFUL << RTC_HWCFGR_TIMESTAMP_Pos)              /*!< 0x00000F000 */
#define RTC_HWCFGR_TIMESTAMP           RTC_HWCFGR_TIMESTAMP_Msk
#define RTC_HWCFGR_OPTIONREG_OUT_Pos   (16U)
#define RTC_HWCFGR_OPTIONREG_OUT_Msk   (0xFFUL << RTC_HWCFGR_OPTIONREG_OUT_Pos)         /*!< 0x00FF0000 */
#define RTC_HWCFGR_OPTIONREG_OUT       RTC_HWCFGR_OPTIONREG_OUT_Msk
#define RTC_HWCFGR_TRUST_ZONE_Pos      (24U)
#define RTC_HWCFGR_TRUST_ZONE_Msk      (0xFUL << RTC_HWCFGR_TRUST_ZONE_Pos)             /*!< 0x0F000000 */
#define RTC_HWCFGR_TRUST_ZONE          RTC_HWCFGR_TRUST_ZONE_Msk
#define RTC_HWCFGR_RIF_Pos             (24U)
#define RTC_HWCFGR_RIF_Msk             (0xFUL << RTC_HWCFGR_RIF_Pos)                    /*!< 0xF0000000 */
#define RTC_HWCFGR_RIF                 RTC_HWCFGR_RIF_Msk

/*******************  Bits definition for RTC_VERR register  **************/
#define RTC_VERR_MINREV_Pos            (0U)
#define RTC_VERR_MINREV_Msk            (0x4UL << RTC_VERR_MINREV_Pos)                   /*!< 0x0000000F */
#define RTC_VERR_MINREV                RTC_VERR_MINREV_Msk                              /*!< RTC Minor version */
#define RTC_VERR_MAJREV_Pos            (4U)
#define RTC_VERR_MAJREV_Msk            (0x4UL << RTC_VERR_MAJREV_Pos)                   /*!< 0x000000F0 */
#define RTC_VERR_MAJREV                RTC_VERR_MAJREV_Msk                              /*!< RTC Major version */

/*******************  Bits definition for RTC_IPIDR register  **************/
#define RTC_IPIDR_ID_Pos               (0U)
#define RTC_IPIDR_ID_Msk               (0xFFFFFFFFUL << RTC_IPIDR_ID_Pos)               /*!< 0xFFFFFFFF */
#define RTC_IPIDR_ID                   RTC_IPIDR_ID_Msk                                 /*!< RTC ID */

/*******************  Bits definition for RTC_SIDR register  **************/
#define RTC_SIDR_SID_Pos               (0U)
#define RTC_SIDR_SID_Msk               (0xFFFFFFFFUL << RTC_SIDR_SID_Pos)               /*!< 0xFFFFFFFF */
#define RTC_SIDR_SID                   RTC_SIDR_SID_Msk                                 /*!< RTC Size ID */


/******************************************************************************/
/*                                                                            */
/*                          Serial Audio Interface                            */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for SAI_GCR register  *******************/
#define SAI_GCR_SYNCIN_Pos         (0U)
#define SAI_GCR_SYNCIN_Msk         (0x3UL << SAI_GCR_SYNCIN_Pos)                /*!< 0x00000003 */
#define SAI_GCR_SYNCIN             SAI_GCR_SYNCIN_Msk                           /*!<SYNCIN[1:0] bits (Synchronization Inputs)   */
#define SAI_GCR_SYNCIN_0           (0x1UL << SAI_GCR_SYNCIN_Pos)                /*!< 0x00000001 */
#define SAI_GCR_SYNCIN_1           (0x2UL << SAI_GCR_SYNCIN_Pos)                /*!< 0x00000002 */

#define SAI_GCR_SYNCOUT_Pos        (4U)
#define SAI_GCR_SYNCOUT_Msk        (0x3UL << SAI_GCR_SYNCOUT_Pos)               /*!< 0x00000030 */
#define SAI_GCR_SYNCOUT            SAI_GCR_SYNCOUT_Msk                          /*!<SYNCOUT[1:0] bits (Synchronization Outputs) */
#define SAI_GCR_SYNCOUT_0          (0x1UL << SAI_GCR_SYNCOUT_Pos)               /*!< 0x00000010 */
#define SAI_GCR_SYNCOUT_1          (0x2UL << SAI_GCR_SYNCOUT_Pos)               /*!< 0x00000020 */

/*******************  Bit definition for SAI_xCR1 register  *******************/
#define SAI_xCR1_MODE_Pos          (0U)
#define SAI_xCR1_MODE_Msk          (0x3UL << SAI_xCR1_MODE_Pos)                 /*!< 0x00000003 */
#define SAI_xCR1_MODE              SAI_xCR1_MODE_Msk                            /*!<MODE[1:0] bits (Audio Block Mode)           */
#define SAI_xCR1_MODE_0            (0x1UL << SAI_xCR1_MODE_Pos)                 /*!< 0x00000001 */
#define SAI_xCR1_MODE_1            (0x2UL << SAI_xCR1_MODE_Pos)                 /*!< 0x00000002 */

