STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp253dxx_ca35.h
/******************  Bit definition for SYSCFG_CBR register  ******************/
#define SYSCFG_CBR_CLL_Pos                                                 (0U)
#define SYSCFG_CBR_CLL_Msk                                                 (0x1UL << SYSCFG_CBR_CLL_Pos)                                                   /*!< 0x00000001 */
#define SYSCFG_CBR_CLL                                                     SYSCFG_CBR_CLL_Msk                                                             /*!< Cortex-M33 LOCKUP (Hardfault) output enable bit */
#define SYSCFG_CBR_PVDL_Pos                                                (2U)
#define SYSCFG_CBR_PVDL_Msk                                                (0x1UL << SYSCFG_CBR_PVDL_Pos)                                                  /*!< 0x00000004 */
#define SYSCFG_CBR_PVDL                                                    SYSCFG_CBR_PVDL_Msk                                                            /*!< PVD lock enable bit */
#define SYSCFG_CBR_BKRAML_Pos                                              (3U)
#define SYSCFG_CBR_BKRAML_Msk                                              (0x1UL << SYSCFG_CBR_BKRAML_Pos)                                                /*!< 0x00000008 */
#define SYSCFG_CBR_BKRAML                                                  SYSCFG_CBR_BKRAML_Msk                                                          /*!< Backup SRAM double ECC error lock bit */
#define SYSCFG_CBR_RETRAML_Pos                                             (4U)
#define SYSCFG_CBR_RETRAML_Msk                                             (0x1UL << SYSCFG_CBR_RETRAML_Pos)                                               /*!< 0x00000010 */
#define SYSCFG_CBR_RETRAML                                                 SYSCFG_CBR_RETRAML_Msk                                                         /*!< Retention SRAM double ECC error lock bit */

/***************  Bit definition for SYSCFG_USB3DRCR register  ****************/
#define SYSCFG_USB3DRCR_USB3DR_HOST_PORT_POWER_CONTROL_PRESENT_Pos         (0U)
#define SYSCFG_USB3DRCR_USB3DR_HOST_PORT_POWER_CONTROL_PRESENT_Msk         (0x1UL << SYSCFG_USB3DRCR_USB3DR_HOST_PORT_POWER_CONTROL_PRESENT_Pos)           /*!< 0x00000001 */
#define SYSCFG_USB3DRCR_USB3DR_HOST_PORT_POWER_CONTROL_PRESENT             SYSCFG_USB3DRCR_USB3DR_HOST_PORT_POWER_CONTROL_PRESENT_Msk                     /*!< This port defines the bit [3] of Capability Parameters (HCCPARAMS) */
#define SYSCFG_USB3DRCR_USB3DR_OVRCUR_POLARITY_Pos                         (1U)
#define SYSCFG_USB3DRCR_USB3DR_OVRCUR_POLARITY_Msk                         (0x1UL << SYSCFG_USB3DRCR_USB3DR_OVRCUR_POLARITY_Pos)                           /*!< 0x00000002 */
#define SYSCFG_USB3DRCR_USB3DR_OVRCUR_POLARITY                             SYSCFG_USB3DRCR_USB3DR_OVRCUR_POLARITY_Msk                                     /*!< Polarity of USB3DR_OVRCUR alternate function: */
#define SYSCFG_USB3DRCR_USB3DR_VBUSEN_POLARITY_Pos                         (2U)
#define SYSCFG_USB3DRCR_USB3DR_VBUSEN_POLARITY_Msk                         (0x1UL << SYSCFG_USB3DRCR_USB3DR_VBUSEN_POLARITY_Pos)                           /*!< 0x00000004 */
#define SYSCFG_USB3DRCR_USB3DR_VBUSEN_POLARITY                             SYSCFG_USB3DRCR_USB3DR_VBUSEN_POLARITY_Msk                                     /*!< Polarity of USB3DR_VBUSEN alternate function: */
#define SYSCFG_USB3DRCR_USB3DR_USB2ONLYH_Pos                               (3U)
#define SYSCFG_USB3DRCR_USB3DR_USB2ONLYH_Msk                               (0x1UL << SYSCFG_USB3DRCR_USB3DR_USB2ONLYH_Pos)                                 /*!< 0x00000008 */
#define SYSCFG_USB3DRCR_USB3DR_USB2ONLYH                                   SYSCFG_USB3DRCR_USB3DR_USB2ONLYH_Msk                                           /*!< - 0: USB3DR controller used in USB3 mode */
#define SYSCFG_USB3DRCR_USB3DR_USB2ONLYD_Pos                               (4U)
#define SYSCFG_USB3DRCR_USB3DR_USB2ONLYD_Msk                               (0x1UL << SYSCFG_USB3DRCR_USB3DR_USB2ONLYD_Pos)                                 /*!< 0x00000010 */
#define SYSCFG_USB3DRCR_USB3DR_USB2ONLYD                                   SYSCFG_USB3DRCR_USB3DR_USB2ONLYD_Msk                                           /*!< - 0: USB3DR controller used in USB3 mode */
#define SYSCFG_USB3DRCR_USB3DR_DEBUG_BUS_SEL_Pos                           (8U)
#define SYSCFG_USB3DRCR_USB3DR_DEBUG_BUS_SEL_Msk                           (0x7UL << SYSCFG_USB3DRCR_USB3DR_DEBUG_BUS_SEL_Pos)                             /*!< 0x00000700 */
#define SYSCFG_USB3DRCR_USB3DR_DEBUG_BUS_SEL                               SYSCFG_USB3DRCR_USB3DR_DEBUG_BUS_SEL_Msk                                       /*!< Selection of USB3DR/USBH debug signals */
#define SYSCFG_USB3DRCR_USB3DR_NOTPCIE_DEBUG_BUS_Pos                       (11U)
#define SYSCFG_USB3DRCR_USB3DR_NOTPCIE_DEBUG_BUS_Msk                       (0x1UL << SYSCFG_USB3DRCR_USB3DR_NOTPCIE_DEBUG_BUS_Pos)                         /*!< 0x00000800 */
#define SYSCFG_USB3DRCR_USB3DR_NOTPCIE_DEBUG_BUS                           SYSCFG_USB3DRCR_USB3DR_NOTPCIE_DEBUG_BUS_Msk                                   /*!< Selection of USB3DR or PCIe debug signals */

/***************  Bit definition for SYSCFG_USB3DRSR register  ****************/
#define SYSCFG_USB3DRSR_USB3DR_CLK_GATE_CTRL_Pos                           (0U)
#define SYSCFG_USB3DRSR_USB3DR_CLK_GATE_CTRL_Msk                           (0x7UL << SYSCFG_USB3DRSR_USB3DR_CLK_GATE_CTRL_Pos)                             /*!< 0x00000007 */
#define SYSCFG_USB3DRSR_USB3DR_CLK_GATE_CTRL                               SYSCFG_USB3DRSR_USB3DR_CLK_GATE_CTRL_Msk                                       /*!< USB3DR Debug register - Clock gating control */

/**************  Bit definition for SYSCFG_COMBOPHYCR1 register  **************/
#define SYSCFG_COMBOPHYCR1_COMBOPHY_REFUSEPAD_Pos                          (0U)
#define SYSCFG_COMBOPHYCR1_COMBOPHY_REFUSEPAD_Msk                          (0x1UL << SYSCFG_COMBOPHYCR1_COMBOPHY_REFUSEPAD_Pos)                            /*!< 0x00000001 */
#define SYSCFG_COMBOPHYCR1_COMBOPHY_REFUSEPAD                              SYSCFG_COMBOPHYCR1_COMBOPHY_REFUSEPAD_Msk                                      /*!< Selection of the source of the COMBOPHY reference clock */
#define SYSCFG_COMBOPHYCR1_COMBOPHY_MPLLMULTIPLIER_Pos                     (1U)
#define SYSCFG_COMBOPHYCR1_COMBOPHY_MPLLMULTIPLIER_Msk                     (0x7FUL << SYSCFG_COMBOPHYCR1_COMBOPHY_MPLLMULTIPLIER_Pos)                      /*!< 0x000000FE */
#define SYSCFG_COMBOPHYCR1_COMBOPHY_MPLLMULTIPLIER                         SYSCFG_COMBOPHYCR1_COMBOPHY_MPLLMULTIPLIER_Msk                                 /*!< Parameter for the frequency selection of the reference clock */
#define SYSCFG_COMBOPHYCR1_COMBOPHY_SSCREFCLKSEL_Pos                       (8U)
#define SYSCFG_COMBOPHYCR1_COMBOPHY_SSCREFCLKSEL_Msk                       (0x1FFUL << SYSCFG_COMBOPHYCR1_COMBOPHY_SSCREFCLKSEL_Pos)                       /*!< 0x0001FF00 */
#define SYSCFG_COMBOPHYCR1_COMBOPHY_SSCREFCLKSEL                           SYSCFG_COMBOPHYCR1_COMBOPHY_SSCREFCLKSEL_Msk                                   /*!< Parameter for the frequency selection of the reference clock */
#define SYSCFG_COMBOPHYCR1_COMBOPHY_REFCLKDIV2_Pos                         (17U)
#define SYSCFG_COMBOPHYCR1_COMBOPHY_REFCLKDIV2_Msk                         (0x1UL << SYSCFG_COMBOPHYCR1_COMBOPHY_REFCLKDIV2_Pos)                           /*!< 0x00020000 */
#define SYSCFG_COMBOPHYCR1_COMBOPHY_REFCLKDIV2                             SYSCFG_COMBOPHYCR1_COMBOPHY_REFCLKDIV2_Msk                                     /*!< Parameter for the frequency selection of the reference clock */
#define SYSCFG_COMBOPHYCR1_COMBOPHY_REFSSPEN_Pos                           (18U)
#define SYSCFG_COMBOPHYCR1_COMBOPHY_REFSSPEN_Msk                           (0x1UL << SYSCFG_COMBOPHYCR1_COMBOPHY_REFSSPEN_Pos)                             /*!< 0x00040000 */
#define SYSCFG_COMBOPHYCR1_COMBOPHY_REFSSPEN                               SYSCFG_COMBOPHYCR1_COMBOPHY_REFSSPEN_Msk                                       /*!< Reference clock enable */
#define SYSCFG_COMBOPHYCR1_COMBOPHY_SSCEN_Pos                              (19U)
#define SYSCFG_COMBOPHYCR1_COMBOPHY_SSCEN_Msk                              (0x1UL << SYSCFG_COMBOPHYCR1_COMBOPHY_SSCEN_Pos)                                /*!< 0x00080000 */
#define SYSCFG_COMBOPHYCR1_COMBOPHY_SSCEN                                  SYSCFG_COMBOPHYCR1_COMBOPHY_SSCEN_Msk                                          /*!< Spread Spectrum enable */
#define SYSCFG_COMBOPHYCR1_COMBOPHY_SSCRANGE_Pos                           (20U)
#define SYSCFG_COMBOPHYCR1_COMBOPHY_SSCRANGE_Msk                           (0x7UL << SYSCFG_COMBOPHYCR1_COMBOPHY_SSCRANGE_Pos)                             /*!< 0x00700000 */
#define SYSCFG_COMBOPHYCR1_COMBOPHY_SSCRANGE                               SYSCFG_COMBOPHYCR1_COMBOPHY_SSCRANGE_Msk                                       /*!< Selects the range of the Spread Spectrum modulation */

/**************  Bit definition for SYSCFG_COMBOPHYCR2 register  **************/
#define SYSCFG_COMBOPHYCR2_COMBOPHY_MODESEL_Pos                            (0U)
#define SYSCFG_COMBOPHYCR2_COMBOPHY_MODESEL_Msk                            (0x3UL << SYSCFG_COMBOPHYCR2_COMBOPHY_MODESEL_Pos)                              /*!< 0x00000003 */
#define SYSCFG_COMBOPHYCR2_COMBOPHY_MODESEL                                SYSCFG_COMBOPHYCR2_COMBOPHY_MODESEL_Msk                                        /*!< Selection of the COMBOPHY mode */
#define SYSCFG_COMBOPHYCR2_COMBOPHY_ISO_DIS_Pos                            (15U)
#define SYSCFG_COMBOPHYCR2_COMBOPHY_ISO_DIS_Msk                            (0x1UL << SYSCFG_COMBOPHYCR2_COMBOPHY_ISO_DIS_Pos)                              /*!< 0x00008000 */
#define SYSCFG_COMBOPHYCR2_COMBOPHY_ISO_DIS                                SYSCFG_COMBOPHYCR2_COMBOPHY_ISO_DIS_Msk                                        /*!< COMBOPHY Isolation cells disable */
#define SYSCFG_COMBOPHYCR2_COMBOPHY_TEST_POWERDOWN_Pos                     (31U)
#define SYSCFG_COMBOPHYCR2_COMBOPHY_TEST_POWERDOWN_Msk                     (0x1UL << SYSCFG_COMBOPHYCR2_COMBOPHY_TEST_POWERDOWN_Pos)                       /*!< 0x80000000 */
#define SYSCFG_COMBOPHYCR2_COMBOPHY_TEST_POWERDOWN                         SYSCFG_COMBOPHYCR2_COMBOPHY_TEST_POWERDOWN_Msk                                 /*!< Force the entire PHY into its lowest power state by turning everything off */

/**************  Bit definition for SYSCFG_COMBOPHYCR3 register  **************/
#define SYSCFG_COMBOPHYCR3_COMBOPHY_PCSRXLOSMASKVAL_Pos                    (0U)
#define SYSCFG_COMBOPHYCR3_COMBOPHY_PCSRXLOSMASKVAL_Msk                    (0x3FFUL << SYSCFG_COMBOPHYCR3_COMBOPHY_PCSRXLOSMASKVAL_Pos)                    /*!< 0x000003FF */
#define SYSCFG_COMBOPHYCR3_COMBOPHY_PCSRXLOSMASKVAL                        SYSCFG_COMBOPHYCR3_COMBOPHY_PCSRXLOSMASKVAL_Msk                                /*!< Masks the incoming LFPS for the number of reference clock cycles equal to the value of this bitfiel */
#define SYSCFG_COMBOPHYCR3_COMBOPHY_PCSTXDEEMPH3P5DB_Pos                   (10U)
#define SYSCFG_COMBOPHYCR3_COMBOPHY_PCSTXDEEMPH3P5DB_Msk                   (0x3FUL << SYSCFG_COMBOPHYCR3_COMBOPHY_PCSTXDEEMPH3P5DB_Pos)                    /*!< 0x0000FC00 */
#define SYSCFG_COMBOPHYCR3_COMBOPHY_PCSTXDEEMPH3P5DB                       SYSCFG_COMBOPHYCR3_COMBOPHY_PCSTXDEEMPH3P5DB_Msk                               /*!< TX De-emphasis at 3 */
#define SYSCFG_COMBOPHYCR3_COMBOPHY_PCSTXDEEMPH6DB_Pos                     (16U)
#define SYSCFG_COMBOPHYCR3_COMBOPHY_PCSTXDEEMPH6DB_Msk                     (0x3FUL << SYSCFG_COMBOPHYCR3_COMBOPHY_PCSTXDEEMPH6DB_Pos)                      /*!< 0x003F0000 */
#define SYSCFG_COMBOPHYCR3_COMBOPHY_PCSTXDEEMPH6DB                         SYSCFG_COMBOPHYCR3_COMBOPHY_PCSTXDEEMPH6DB_Msk                                 /*!< TX De-emphasis at 6 dB (USB3 use case) */
#define SYSCFG_COMBOPHYCR3_COMBOPHY_PCSTXSWINGFULL_Pos                     (22U)
#define SYSCFG_COMBOPHYCR3_COMBOPHY_PCSTXSWINGFULL_Msk                     (0x7FUL << SYSCFG_COMBOPHYCR3_COMBOPHY_PCSTXSWINGFULL_Pos)                      /*!< 0x1FC00000 */
#define SYSCFG_COMBOPHYCR3_COMBOPHY_PCSTXSWINGFULL                         SYSCFG_COMBOPHYCR3_COMBOPHY_PCSTXSWINGFULL_Msk                                 /*!< TX amplitude (full swing mode) (USB3 and PCIe use cases) */
#define SYSCFG_COMBOPHYCR3_COMBOPHY_RXLOSLFPSEN_Pos                        (29U)
#define SYSCFG_COMBOPHYCR3_COMBOPHY_RXLOSLFPSEN_Msk                        (0x1UL << SYSCFG_COMBOPHYCR3_COMBOPHY_RXLOSLFPSEN_Pos)                          /*!< 0x20000000 */
#define SYSCFG_COMBOPHYCR3_COMBOPHY_RXLOSLFPSEN                            SYSCFG_COMBOPHYCR3_COMBOPHY_RXLOSLFPSEN_Msk                                    /*!< Enables the RX LOS LFPS mode */
#define SYSCFG_COMBOPHYCR3_COMBOPHY_RTUNE_REQ_Pos                          (30U)
#define SYSCFG_COMBOPHYCR3_COMBOPHY_RTUNE_REQ_Msk                          (0x1UL << SYSCFG_COMBOPHYCR3_COMBOPHY_RTUNE_REQ_Pos)                            /*!< 0x40000000 */
#define SYSCFG_COMBOPHYCR3_COMBOPHY_RTUNE_REQ                              SYSCFG_COMBOPHYCR3_COMBOPHY_RTUNE_REQ_Msk                                      /*!< Instructs the combo PHY to perform a termination calibration */

/**************  Bit definition for SYSCFG_COMBOPHYCR4 register  **************/
#define SYSCFG_COMBOPHYCR4_COMBOPHY_RX0_EQ_Pos                             (0U)
#define SYSCFG_COMBOPHYCR4_COMBOPHY_RX0_EQ_Msk                             (0x7UL << SYSCFG_COMBOPHYCR4_COMBOPHY_RX0_EQ_Pos)                               /*!< 0x00000007 */
#define SYSCFG_COMBOPHYCR4_COMBOPHY_RX0_EQ                                 SYSCFG_COMBOPHYCR4_COMBOPHY_RX0_EQ_Msk                                         /*!< RX Equalizer Setting */
#define SYSCFG_COMBOPHYCR4_COMBOPHY_LOS_LEVEL_Pos                          (3U)
#define SYSCFG_COMBOPHYCR4_COMBOPHY_LOS_LEVEL_Msk                          (0x1FUL << SYSCFG_COMBOPHYCR4_COMBOPHY_LOS_LEVEL_Pos)                           /*!< 0x000000F8 */
#define SYSCFG_COMBOPHYCR4_COMBOPHY_LOS_LEVEL                              SYSCFG_COMBOPHYCR4_COMBOPHY_LOS_LEVEL_Msk                                      /*!< Loss-of-Signal Detector Sensitivity Level Control */
#define SYSCFG_COMBOPHYCR4_COMBOPHY_LOS_BIAS_Pos                           (8U)
#define SYSCFG_COMBOPHYCR4_COMBOPHY_LOS_BIAS_Msk                           (0x7UL << SYSCFG_COMBOPHYCR4_COMBOPHY_LOS_BIAS_Pos)                             /*!< 0x00000700 */
#define SYSCFG_COMBOPHYCR4_COMBOPHY_LOS_BIAS                               SYSCFG_COMBOPHYCR4_COMBOPHY_LOS_BIAS_Msk                                       /*!< Loss-of-Signal Detector Threshold Level Control */
#define SYSCFG_COMBOPHYCR4_COMBOPHY_PCS_TX_DEEMPH_GEN1_Pos                 (11U)
#define SYSCFG_COMBOPHYCR4_COMBOPHY_PCS_TX_DEEMPH_GEN1_Msk                 (0x3FUL << SYSCFG_COMBOPHYCR4_COMBOPHY_PCS_TX_DEEMPH_GEN1_Pos)                  /*!< 0x0001F800 */
#define SYSCFG_COMBOPHYCR4_COMBOPHY_PCS_TX_DEEMPH_GEN1                     SYSCFG_COMBOPHYCR4_COMBOPHY_PCS_TX_DEEMPH_GEN1_Msk                             /*!< TX De-emphasis at 3 */
#define SYSCFG_COMBOPHYCR4_COMBOPHY_PCS_TX_SWING_LOW_Pos                   (17U)
#define SYSCFG_COMBOPHYCR4_COMBOPHY_PCS_TX_SWING_LOW_Msk                   (0x7FUL << SYSCFG_COMBOPHYCR4_COMBOPHY_PCS_TX_SWING_LOW_Pos)                    /*!< 0x00FE0000 */
#define SYSCFG_COMBOPHYCR4_COMBOPHY_PCS_TX_SWING_LOW                       SYSCFG_COMBOPHYCR4_COMBOPHY_PCS_TX_SWING_LOW_Msk                               /*!< TX amplitude (low swing mode) (PCIe use case) */
#define SYSCFG_COMBOPHYCR4_COMBOPHY_TX_TERM_OFFSET_Pos                     (24U)
#define SYSCFG_COMBOPHYCR4_COMBOPHY_TX_TERM_OFFSET_Msk                     (0x1FUL << SYSCFG_COMBOPHYCR4_COMBOPHY_TX_TERM_OFFSET_Pos)                      /*!< 0x1F000000 */
#define SYSCFG_COMBOPHYCR4_COMBOPHY_TX_TERM_OFFSET                         SYSCFG_COMBOPHYCR4_COMBOPHY_TX_TERM_OFFSET_Msk                                 /*!< Transmitter termination offset */
#define SYSCFG_COMBOPHYCR4_COMBOPHY_TX_VBOOST_LEVEL_Pos                    (29U)
#define SYSCFG_COMBOPHYCR4_COMBOPHY_TX_VBOOST_LEVEL_Msk                    (0x7UL << SYSCFG_COMBOPHYCR4_COMBOPHY_TX_VBOOST_LEVEL_Pos)                      /*!< 0xE0000000 */
#define SYSCFG_COMBOPHYCR4_COMBOPHY_TX_VBOOST_LEVEL                        SYSCFG_COMBOPHYCR4_COMBOPHY_TX_VBOOST_LEVEL_Msk                                /*!< TX voltage boost level */

